// Содержимое документации крч дааа
// Содержимое файла "Документация" для Absorb UI
const SYSTEM_DOCS_CONTENT = 'Absorb UI - эксперимент, созданный мной (@thetruetreelovr/Александр Жуков) с целью ИМИТИРОВАТЬ операционную систему\n\
и ее базовые функции, при том используя исключительно вэб-технологии.\n\
Использованные мной штуки (Кредиты или как это пишется там):\n\
1) HTML5 - структура и голая основа всего\n\
2) CSS3(+Transitions & Animations) - общий дизайн и тактильность системы: оформления, иконки, анимации появления,\n\
реакция на действия, полупрозрачные/блюр элементы и др.\n\
3) Vanilla JavaScript (ES6+) - весь "движок" (если это можно так назвать) написан на чистом JS без тяжелых\n\
библиотек и прочей сложной фигни. Он управляет логикой открытия окон, слоями и много много чего другого что мне лень\n\
перечислять здесь.\n\
4) VFS (Virtual File System): специальная модель данных, которая ИМИТИРУЕТ НАСТОЯЩУЮ структуру папок и файлов,\n\
позволяя "системе" "видеть" файлы без реального доступа к хранилищу или чему то подобному крч\n\
5) D&D(DOM Drag & Drop/rus.ДнД/ДРАГнДРОП) API: самописная(разумеется на основе чужих наработок сам я бы не смог) логика\n\
перемещения окон по экрану с расчетом координат относительно курсора мыши чтобы было похоже на привычные винду/мак/линукс\n\
\n\
----------------.прочитай меня------------------------------\n\
Напоминаю что это не более чем очередной мой эксперимент на уровне "а чо если" и система не работает с реальными файлами/\n\
библеотеками что категорически важно для любой даже самой ужастной операционной системы, а значит не может иметь статус\n\
реальной ос не в каком понимании, это скорее многофункциональный красивый сайт-подделка под ос, который реально работает.\n\
\n\
Делался проект чтобы посмотреть свои возможности, взять себя на понт и потренироваться в (возможно неожиданно) рисовании\n\
иконок/интерфейса в принципе. Обновления скорее всего будут но не стоит ждать чего то грандиозного, опять же это нужно\n\
для РаЗвЛеЧеНиЯ.\n\
----------------.прочитай меня все------------------------------\n\
\n\
.П.С(.пятая)\n\
для изменения иконок и фона рабочего стола нужно в файле конфига заменить путь соответствующих 2х переменных на\n\
адрес к папке с изображения, наименования которых так же выписанны там.\n\
.пс(.пятая)';